backend/app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE (lower(email) = $1) LIMIT $2  [[nil, "jane@test.com"], ["LIMIT", 1]]
---
      def login
        email = params[:email].to_s.downcase.strip
        user = User.find_by("lower(email) = ?", email)