backend/app/controllers/api/v1/expenses_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
INSERT INTO "expenses" ("amount", "category_id", "created_at", "description", "payment_reference", "reimbursed_at", "spent_date", "status", "submitted_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "expense_histories" ("actor_id", "actor_name", "actor_type", "comment", "created_at", "expense_id", "new_status", "previous_status") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create
        category = Category.find_by(id: expense_params[:category_id])
        if category.nil? || !category.is_active?
          return render json: { error: "Selected category is inactive or does not exist." }, status: :unprocessable_entity
        end

        @expense = current_user.expenses.build(expense_params)
        @expense.status = "draft"

        Expense.transaction do
          if @expense.save
            @expense.expense_histories.create!(
              actor: current_user,
              actor_type: "user",
              actor_name: current_user.name,
              previous_status: nil,
              new_status: "draft",
              comment: "Created draft expense",
              created_at: Time.current
            )

SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
      def set_expense
        @expense = Expense.find_by(id: params[:id])