backend/app/controllers/api/v1/reports_controller.rb

      def index
        start_date = params[:start_date].present? ? Date.parse(params[:start_date]) : (Date.current - 5.months).beginning_of_month
        end_date = params[:end_date].present? ? Date.parse(params[:end_date]) : Date.current

        expenses = Expense.where(status: %w[approved reimbursed])
                          .where(spent_date: start_date..end_date)
                          .includes(:category)

        grouped = {}
        categories_by_id = Category.all.index_by(&:id)
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."status" IN ($1, $2) AND "expenses"."spent_date" BETWEEN $3 AND $4  [["status", "approved"], ["status", "reimbursed"], ["spent_date", "2026-04-01"], ["spent_date", "2026-09-16"]]
SELECT "categories".* FROM "categories"