backend/app/controllers/api/v1/reviews_controller.rb

      def set_expense
        @expense = Expense.find_by(id: params[:id])
---
SELECT "expenses".* FROM "expenses" WHERE "expenses"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]